---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsInstAlwaysUp
source: html/0c2f1897-ee61-9bbd-c598-3394e7d2ffa3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsInstAlwaysUp Property

"Show Up arrow in all views"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsInstAlwaysUp { get; }
```